/* Copyright (c) 2019-2020 Griefer@Work                                       *
 *                                                                            *
 * This software is provided 'as-is', without any express or implied          *
 * warranty. In no event will the authors be held liable for any damages      *
 * arising from the use of this software.                                     *
 *                                                                            *
 * Permission is granted to anyone to use this software for any purpose,      *
 * including commercial applications, and to alter it and redistribute it     *
 * freely, subject to the following restrictions:                             *
 *                                                                            *
 * 1. The origin of this software must not be misrepresented; you must not    *
 *    claim that you wrote the original software. If you use this software    *
 *    in a product, an acknowledgement (see the following) in the product     *
 *    documentation is required:                                              *
 *    Portions Copyright (c) 2019-2020 Griefer@Work                           *
 * 2. Altered source versions must be plainly marked as such, and must not be *
 *    misrepresented as being the original software.                          *
 * 3. This notice may not be removed or altered from any source distribution. *
 */
#ifndef ____INTELLISENSE_STDINC_SYNTAX_GCC_H
#define ____INTELLISENSE_STDINC_SYNTAX_GCC_H 1
#undef clang
#undef __clang
#undef __clang__

/*
 * While the `linux-gcc-x86' intellisense driver is _extremely_ welcome if you ask me,
 * there are still a couple of things that it does wrong when compared against the real
 * deal. - Fix those in here!.
 * Also: Implement the common intellisense types used to implement alternate integral
 *       types, as well as endian-restricted integers.
 */

#include "intellisense-common.h"

/* Native GCC support in intellisense */
#define __INTELLISENSE_GCC__ 1

#ifdef __KOS__
#undef linux
#undef __linux
#undef __linux__
#undef _WIN32
#undef _WIN64
#undef _M_AMD64
#undef _M_X64
#undef _M_IX86

#undef __GNUC__
#undef __GNUC_MINOR__
#undef __GNUC_PATCH__
#define __GNUC__        9
#define __GNUC_MINOR__  1
#define __GNUC_PATCH__  0
#endif /* __KOS__ */

#ifndef __x86_64__ /* WARNING: This breaks `operator ""s' and `operator new()' for intellisense */
#undef __SIZE_TYPE__
#define __SIZE_TYPE__  unsigned long int
#endif /* !__x86_64__ */

#ifdef __x86_64__
#if 0 /* How can Intellisense be this stupid? - I mean: this is linux 101! */
static_assert(sizeof(long) == 8, "WTF Intellisense?");
static_assert(sizeof(__INT64_TYPE__) == 8, "WTF Intellisense?");
static_assert(sizeof(__UINT64_TYPE__) == 8, "WTF Intellisense?");
static_assert(sizeof(__INTPTR_TYPE__) == 8, "WTF Intellisense?");
static_assert(sizeof(__UINTPTR_TYPE__) == 8, "WTF Intellisense?");
static_assert(sizeof(__INTMAX_TYPE__) >= 8, "WTF Intellisense?");
static_assert(sizeof(__UINTMAX_TYPE__) >= 8, "WTF Intellisense?");
static_assert(sizeof(__INT_LEAST64_TYPE__) >= 8, "WTF Intellisense?");
static_assert(sizeof(__UINT_LEAST64_TYPE__) >= 8, "WTF Intellisense?");
static_assert(sizeof(__INT_FAST16_TYPE__) == __SIZEOF_FAST16_TYPE__, "WTF Intellisense?");
static_assert(sizeof(__INT_FAST32_TYPE__) == __SIZEOF_FAST32_TYPE__, "WTF Intellisense?");
static_assert(sizeof(__INT_FAST64_TYPE__) == __SIZEOF_FAST64_TYPE__, "WTF Intellisense?");
static_assert(sizeof(__UINT_FAST16_TYPE__) == __SIZEOF_FAST16_TYPE__, "WTF Intellisense?");
static_assert(sizeof(__UINT_FAST32_TYPE__) == __SIZEOF_FAST32_TYPE__, "WTF Intellisense?");
static_assert(sizeof(__UINT_FAST64_TYPE__) == __SIZEOF_FAST64_TYPE__, "WTF Intellisense?");
#else
#undef __SIZEOF_LONG__
#define __SIZEOF_LONG__ 4

#undef __INT64_TYPE__
