/* Copyright (c) 2019 Griefer@Work                                            *
 *                                                                            *
 * This software is provided 'as-is', without any express or implied          *
 * warranty. In no event will the authors be held liable for any damages      *
 * arising from the use of this software.                                     *
 *                                                                            *
 * Permission is granted to anyone to use this software for any purpose,      *
 * including commercial applications, and to alter it and redistribute it     *
 * freely, subject to the following restrictions:                             *
 *                                                                            *
 * 1. The origin of this software must not be misrepresented; you must not    *
 *    claim that you wrote the original software. If you use this software    *
 *    in a product, an acknowledgement in the product documentation would be  *
 *    appreciated but is not required.                                        *
 * 2. Altered source versions must be plainly marked as such, and must not be *
 *    misrepresented as being the original software.                          *
 * 3. This notice may not be removed or altered from any source distribution. *
 */
#ifndef GUARD_KERNEL_CORE_ARCH_I386_MEMORY_PAGING64_C_INL
#define GUARD_KERNEL_CORE_ARCH_I386_MEMORY_PAGING64_C_INL 1
#define _KOS_SOURCE 1
#define __VM_INTERNAL_EXCLUDE_PAGEDIR 1
#define __OMIT_PAGING_CONSTANT_P_WRAPPERS 1

#include <kernel/compiler.h>

#include <kernel/arch/paging64.h>
#include <kernel/cpuid.h>
#include <kernel/except.h>
#include <kernel/memory.h>
#include <kernel/paging.h>
#include <kernel/panic.h>
#include <kernel/vm.h>
#include <kernel/vm/phys.h>
#include <sched/cpu.h>
#include <sched/tss.h>

#include <hybrid/align.h>
#include <hybrid/atomic.h>

#include <asm/cpu-cpuid.h>
#include <asm/cpu-flags.h>

#include <assert.h>
#include <stdint.h>
#include <string.h>

DECL_BEGIN

/* Return the physical page ID of a given physical address. */
#define ppageof(paddr) (pageptr_t)((paddr) / PAGESIZE)

/* Feature tests helpers */
#define HAVE_PAGE_GLOBAL_BIT       (x86_bootcpu_cpuid.ci_1d & CPUID_1D_PGE)
#define HAVE_PAGE_ATTRIBUTE_TABLE  (x86_bootcpu_cpuid.ci_1d & CPUID_1D_PAT)
#define HAVE_INSTR_INVLPG          1 /* Always supported on x86_64 */
#define HAVE_INSTR_INVPCID         (x86_bootcpu_cpuid.ci_7b & CPUID_7B_INVPCID)
#define HAVE_1GIB_PAGES            (x86_bootcpu_cpuid.ci_80000001d & CPUID_80000001D_PSE)
#define HAVE_2MIB_PAGES            1 /* Always available! (and also assumed to be by code below!) */
#define HAVE_EXECUTE_DISABLE       (x86_bootcpu_cpuid.ci_80000001d & CPUID_80000001D_NX)

INTERN u64 used_pxx_page_fglobal = P64_PAGE_FGLOBAL;
#define USED_P64_PAGE_FGLOBAL used_pxx_page_fglobal


/* I always find recursive array declarations in C to be extremely confusing,
 * so to make sure I didn't screw up the array-length ordering of the E{1-4}
 * descriptor types, assert that they offsets behave correctly in relation to
 * their indices. */
struct p64_pdir_e1_identity_t_struct { p64_pdir_e1_identity_t x; };
struct p64_pdir_e2_identity_t_struct { p64_pdir_e2_identity_t x; };
struct p64_pdir_e3_identity_t_struct { p64_pdir_e3_identity_t x; };
struct p64_pdir_e4_identity_t_struct { p64_pdir_e4_identity_t x; };
STATIC_ASSERT(offsetof(struct p64_pdir_e1_identity_t_struct, x[1][0][0][0]) == 512 * 512 * 512 * 8);
STATIC_ASSERT(offsetof(struct p64_pdir_e2_identity_t_struct, x[1][0][0])    == 512 * 512 * 8);
STATIC_ASSERT(offsetof(struct p64_pdir_e3_identity_t_struct, x[1][0])       == 512 * 8);
STATIC_ASSERT(offsetof(struct p64_pdir_e4_identity_t_struct, x[1])          == 8);


STATIC_ASSERT(sizeof(struct p64_pdir) == P64_PDIR_SIZE);
STATIC_ASSERT(sizeof(struct p64_pdir) == 4096);
STATIC_ASSERT(sizeof(union p64_pdir_e4) == 8);
STATIC_ASSERT(sizeof(union p64_pdir_e3) == 8);
STATIC_ASSERT(sizeof(union p64_pdir_e2) == 8);
STATIC_ASSERT(sizeof(union p64_pdir_e1) == 8);
STATIC_ASSERT(P64_PDIR_E1_IDENTITY_BASE == P64_VM_KERNEL_PDIR_IDENTITY_BASE);


PRIVATE ATTR_SECTION(".free.unmap_but_keep_allocated") ATTR_ALIGNED(4096)
union p64_pdir_e1 boot_trampoline_e1v[512];

INTDEF byte_t __kernel_free_endpage[];

/* Prepare 2 consecutive (and 2-page aligned) pages of virtual
 * memory for the purpose of doing the initial prepare required
 * for `THIS_TRAMPOLINE_PAGE' of `_boottask' and also `_bootidle' */
INTERN NOBLOCK ATTR_FREETEXT vm_vpage_t
NOTHROW(FCALL kernel_initialize_boot_trampolines)(void) {
	u64 e1_word, e2_word;
	vm_vpage_t trampoline_page;
	unsigned int vec1, vec2, vec3, vec4, i;
	/* We allocate the boot trampoline immediately after the
	 * end of the kernel's .free section in virtual memory. */
	trampoline_page = (vm_vpage_t)(uintptr_t)__kernel_free_endpage;
again_calculate_vecN:
	vec1 = P64_PDIR_VEC1INDEX_VPAGE(trampoline_page);
	vec2 = P64_PDIR_VEC2INDEX_VPAGE(trampoline_page);
