/* Copyright (c) 2019-2022 Griefer@Work                                       *
 *                                                                            *
 * This software is provided 'as-is', without any express or implied          *
 * warranty. In no event will the authors be held liable for any damages      *
 * arising from the use of this software.                                     *
 *                                                                            *
 * Permission is granted to anyone to use this software for any purpose,      *
 * including commercial applications, and to alter it and redistribute it     *
 * freely, subject to the following restrictions:                             *
 *                                                                            *
 * 1. The origin of this software must not be misrepresented; you must not    *
 *    claim that you wrote the original software. If you use this software    *
 *    in a product, an acknowledgement (see the following) in the product     *
 *    documentation is required:                                              *
 *    Portions Copyright (c) 2019-2022 Griefer@Work                           *
 * 2. Altered source versions must be plainly marked as such, and must not be *
 *    misrepresented as being the original software.                          *
 * 3. This notice may not be removed or altered from any source distribution. *
 */
#ifndef GUARD_KERNEL_CORE_ARCH_I386_MEMORY_PAGING32_PAE_C_INL
#define GUARD_KERNEL_CORE_ARCH_I386_MEMORY_PAGING32_PAE_C_INL 1
#define __OMIT_PAGING_CONSTANT_P_WRAPPERS
#define __WANT_MMAN_EXCLUDE_PAGEDIR
#define _KOS_SOURCE 1

#include <kernel/compiler.h>

#include <debugger/config.h>
#include <debugger/hook.h>
#include <debugger/io.h>
#include <debugger/rt.h>
#include <kernel/arch/paging32-pae.h>
#include <kernel/except.h>
#include <kernel/memory.h>
#include <kernel/mman.h>
#include <kernel/mman/phys.h>
#include <kernel/mman/sync.h>
#include <kernel/paging.h>
#include <kernel/x86/cpuid.h>

#include <hybrid/align.h>
#include <hybrid/atomic.h>
#include <hybrid/sched/preemption.h>

#include <asm/cpu-cpuid.h>

#include <assert.h>
#include <inttypes.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#ifndef CONFIG_NO_PAGING_PAE

#include "paging.h"
#include "paging32-com.h"


DECL_BEGIN

/* Return the physical page ID of a given physical address. */
#define ppageof(paddr) (physpage_t)((paddr) / PAGESIZE)

#if defined(__cplusplus) && 0
extern "C++" {
template<class T, size_t len> using my_array_t = T[len];
}
typedef int TYPE_X[2];
typedef int TYPE_Y[2][3]; /* This is array<array<int, 3>, 2> */
typedef TYPE_X TYPE_Z[3]; /* This is array<array<int, 2>, 3> */
static_assert(__builtin_types_compatible_p(TYPE_X, my_array_t<int, 2>));
static_assert(__builtin_types_compatible_p(TYPE_Y, my_array_t<my_array_t<int, 3>, 2>));
static_assert(__builtin_types_compatible_p(TYPE_Z, my_array_t<my_array_t<int, 2>, 3>));
#endif /* __cplusplus */

/* I always find recursive array declarations in C to be extremely confusing,
 * so  to make sure I didn't screw up the array-length ordering of the E{1-3}
 * descriptor types, assert that they offsets behave correctly in relation to
 * their indices. */
struct pae_pdir_e1_identity_t_struct { pae_pdir_e1_identity_t x; };
struct pae_pdir_e2_identity_t_struct { pae_pdir_e2_identity_t x; };
struct pae_pdir_e3_identity_t_struct { pae_pdir_e3_identity_t x; };
static_assert(offsetof(struct pae_pdir_e1_identity_t_struct, x[1][0][0]) == 512 * 512 * 8);
static_assert(offsetof(struct pae_pdir_e2_identity_t_struct, x[1][0])    == 512 * 8);
static_assert(offsetof(struct pae_pdir_e3_identity_t_struct, x[1])       == 8);


#ifndef __x86_64__
/* We can't use the the normal ATOMIC_READ(), since the code that GCC (rightfully) generates
 * for atomically reading a 64-bit  value makes use of the  FPU, which is something that  we
 * can't have, as the paging system can't possibly make use of the FPU, as this would create
 * a dependency on the heap sub-system (which could cause E_BADALLOC), as well as a loop:
 *
 *    PAGING ─> FPU ─> MALLOC ─> HEAP ─> MMAP
 *       ^                                │
 *       │                                │
 *       └────────────────────────────────┘
 *
 * So  because of all of this, we are  left having to implement an atomic read by
 * reading 64-bit words in 2 steps (hi/lo part), which may yield corrupted values
 * if another thread/cpu did a reverse write at the same time.
 * For this reason, we need to use the cmpxchg8b instruction which we're already
 * depending on regardless in order to perform the read.
 */
#if 1 /* Since we need to use a cmpxchg8b anyways, it's better to \
       * simply use it to figure out the correct value from the get-go */
#define ATOMIC_READ64(word)                              \
	XBLOCK({                                             \
		u64 _res;                                        \
		_res = ATOMIC_CMPXCH_VAL(*(u64 *)&(word), 0, 0); \
		XRETURN _res;                                    \
	})
#else
#define ATOMIC_READ64(word)                              \
	XBLOCK({                                             \
		u64 _res;                                        \
		do {                                             \
			COMPILER_READ_BARRIER();                     \
			_res = (word);                               \
			COMPILER_READ_BARRIER();                     \
		} while (!ATOMIC_CMPXCH_WEAK(word, _res, _res)); \
		XRETURN _res;                                    \
	})
#endif
#define ATOMIC_READ64_ALLOW_CORRUPT(word) \
	XBLOCK({                              \
		u64 _res;                         \
		COMPILER_READ_BARRIER();          \
		_res = (word);                    \
		COMPILER_READ_BARRIER();          \
		XRETURN _res;                     \
	})
#endif /* !__x86_64__ */


#ifndef ATOMIC_READ64
#define ATOMIC_READ64(word) ATOMIC_READ(word)
#endif /* !ATOMIC_READ64 */

#ifndef ATOMIC_READ64_ALLOW_CORRUPT
#define ATOMIC_READ64_ALLOW_CORRUPT(word) ATOMIC_READ64(word)
#endif /* !ATOMIC_READ64_ALLOW_CORRUPT */


static_assert(sizeof(struct pae_pdir) == PAE_PDIR_SIZE);
static_assert(sizeof(struct pae_pdir) == 32);
static_assert(sizeof(union pae_pdir_e3) == 8);
static_assert(sizeof(union pae_pdir_e2) == 8);
static_assert(sizeof(union pae_pdir_e1) == 8);
static_assert(PAE_PDIR_E1_IDENTITY_BASE == PAE_MMAN_KERNEL_PDIR_IDENTITY_BASE);



/* Initialize the given page directory.
 * The caller is required to allocate the page directory
 * controller itself, which  must be  aligned and  sized
 * according to `PAGEDIR_ALIGN' and `PAGEDIR_SIZE'. */
PRIVATE NOBLOCK WUNUSED NONNULL((1)) bool
NOTHROW(FCALL pae_pagedir_tryinit)(VIRT struct pae_pdir *__restrict self) {
	u64 e3[4];
	/* Assert constants that are used below. */
	static_assert(PAE_PDIR_VEC3INDEX(PAE_MMAN_KERNEL_PDIR_IDENTITY_BASE) == 3);
	static_assert(PAE_PDIR_VEC2INDEX(PAE_MMAN_KERNEL_PDIR_IDENTITY_BASE) == 508);
	static_assert(PAE_PDIR_VEC1INDEX(PAE_MMAN_KERNEL_PDIR_IDENTITY_BASE) == 0);
	assert(IS_ALIGNED((uintptr_t)self, PAGESIZE));

	e3[0] = (u64)page_mallocone_for_paging();
	if unlikely((physpage_t)e3[0] == PHYSPAGE_INVALID)
		goto err_0;
	e3[1] = (u64)page_mallocone_for_paging();
	if unlikely((physpage_t)e3[1] == PHYSPAGE_INVALID)
